{
  "PageType": 0,
  "ColumnCount": 92,
  "RowCount": 50,
  "Formulas": {
    "2,1": "IF(采购_退货=\"采购\",\"材料采购单\",\"采购退货单\")",
    "15,84": "IFERROR(ODATA(\"采购单主表?$select=审核人&$filter=采购单号 eq \"&IF(ISBLANK(采购单号),\"null\",\"'\"&采购单号&\"'\")),\"\")",
    "16,84": "IFERROR(ODATA(\"采购单主表?$select=审核时间&$filter=采购单号 eq \"&IF(ISBLANK(采购单号),\"null\",\"'\"&采购单号&\"'\")),\"\")",
    "13,81": "IF((数据库行数<>0)*(数据库行数=最大权重),\"可排序\",\"不可排序\")",
    "5,39": "IF(采购_退货=\"采购\",\"采购日期：\",\"退货日期：\")",
    "14,84": "IFERROR(ODATA(\"采购单主表?$select=审核状态&$filter=采购单号 eq \"&IF(ISBLANK(采购单号),\"null\",\"'\"&采购单号&\"'\")),\"\")",
    "23,81": "TEXTJOIN(\",\",TRUE,AY13)",
    "8,5": "SUM(AG13)",
    "3,43": "IF(之前审核状态=\"\",IF(AT3=\"未审核\",\"\",NOW()),IF(AT3=之前审核状态,之前审核时间,NOW()))",
    "3,40": "IF(之前审核状态=\"\",IF(AT3=\"未审核\",\"\",当前用户),IF(AT3=之前审核状态,之前审核人,当前用户))",
    "12,81": "COUNTA(AY13)",
    "5,29": "IF(采购_退货=\"采购\",\"采购人：\",\"退货人：\")",
    "12,32": "Y13*AD13",
    "8,18": "IF(采购_退货=\"采购\",\"已付款：\",\"已退款：\")",
    "8,25": "IF(采购_退货=\"采购\",\"剩余应付：\",\"剩余应退：\")",
    "12,15": "IF(采购_退货=\"采购\",AY13&采购单号,BJ13)",
    "3,29": "IF(采购_退货=\"采购\",\"入库单号：\",\"出库单号：\")",
    "8,29": "折后金额-已付款",
    "9,84": "ODATA(\"采购单明细表/$count?$filter=采购单号 eq \"&IF(ISBLANK(采购单号),\"null\",\"'\"&采购单号&\"'\"))",
    "12,55": "ROW()",
    "12,3": "IF(AY13=\"\",\"\",ODATA(\"库存材料主表?$select=材料名称&$filter=材料编号 eq \"&IF(ISBLANK(AY13),\"null\",\"'\"&AY13&\"'\")))",
    "12,22": "IF(AY13=\"\",\"\",ODATA(\"库存材料主表?$select=单位&$filter=材料编号 eq \"&IF(ISBLANK(AY13),\"null\",\"'\"&AY13&\"'\")))",
    "11,24": "采购_退货&\"数量\"",
    "12,48": "IF((出入库单号<>\"\")+(审核状态=\"已审核\"),\"\",\"删除\")",
    "43,81": "SUM(Y13)",
    "44,81": "SUM(AG13)"
  },
  "CustomNames": [
    {
      "Name": "采购_退货",
      "Formula": "采购单填报!$CG$8"
    },
    {
      "Name": "审核人",
      "Formula": "采购单填报!$AO$4"
    },
    {
      "Name": "审核时间",
      "Formula": "采购单填报!$AR$4"
    },
    {
      "Name": "开单人",
      "Formula": "采购单填报!$Y$34"
    },
    {
      "Name": "开单时间",
      "Formula": "采购单填报!$AB$34"
    },
    {
      "Name": "最后保存人",
      "Formula": "采购单填报!$AL$34"
    },
    {
      "Name": "最后保存时间",
      "Formula": "采购单填报!$AP$34"
    },
    {
      "Name": "出入库单号",
      "Formula": "采购单填报!$AH$4"
    },
    {
      "Name": "已选择材料编号",
      "Formula": "采购单填报!$CD$24"
    },
    {
      "Name": "采购单号",
      "Formula": "采购单填报!$Z$4"
    },
    {
      "Name": "供应商编号",
      "Formula": "采购单填报!$W$6"
    },
    {
      "Name": "合计金额",
      "Formula": "采购单填报!$F$9"
    },
    {
      "Name": "折后金额",
      "Formula": "采购单填报!$N$9"
    },
    {
      "Name": "已付款",
      "Formula": "采购单填报!$W$9"
    },
    {
      "Name": "剩余应付",
      "Formula": "采购单填报!$AD$9"
    },
    {
      "Name": "当前用户",
      "Formula": "采购单填报!$CG$3"
    },
    {
      "Name": "之前审核状态",
      "Formula": "采购单填报!$CG$15"
    },
    {
      "Name": "之前审核人",
      "Formula": "采购单填报!$CG$16"
    },
    {
      "Name": "之前审核时间",
      "Formula": "采购单填报!$CG$17"
    },
    {
      "Name": "公司简称",
      "Formula": "采购单填报!$CG$4"
    },
    {
      "Name": "最大权重",
      "Formula": "采购单填报!$CD$13"
    },
    {
      "Name": "排序条件",
      "Formula": "采购单填报!$CD$14"
    },
    {
      "Name": "数据库行数",
      "Formula": "采购单填报!$CG$10"
    },
    {
      "Name": "采购单id",
      "Formula": "采购单填报!$CG$6"
    },
    {
      "Name": "供商名称",
      "Formula": "采购单填报!$F$6"
    },
    {
      "Name": "采购人",
      "Formula": "采购单填报!$AH$6"
    },
    {
      "Name": "采购日期",
      "Formula": "采购单填报!$AR$6"
    },
    {
      "Name": "附件",
      "Formula": "采购单填报!$B$35"
    },
    {
      "Name": "备注",
      "Formula": "采购单填报!$O$35"
    },
    {
      "Name": "审核状态",
      "Formula": "采购单填报!$AT$3"
    },
    {
      "Name": "返回码",
      "Formula": "采购单填报!$CG$19"
    },
    {
      "Name": "返回值",
      "Formula": "采购单填报!$CG$20"
    },
    {
      "Name": "本单数量",
      "Formula": "采购单填报!$CD$44"
    },
    {
      "Name": "本单金额",
      "Formula": "采购单填报!$CD$45"
    }
  ]
}