{
  "PageType": 0,
  "ColumnCount": 124,
  "RowCount": 50,
  "Formulas": {
    "24,63": "IFERROR(ODATA(\"板材属性表?$select=废料单价&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "24,45": "IFERROR(ODATA(\"板材属性表?$select=宽&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "9,53": "IFERROR(雕工费/雕工成品数量,0)",
    "24,29": "IFERROR(ODATA(\"板材常用厚度表?$select=显示厚度&$filter=板材id eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)&\" and 实际厚度 eq \"&IF(ISBLANK(材料厚度),\"null\",材料厚度)),材料厚度)&\"mm\"",
    "14,28": "IF((材料名称id=\"\")+(材料厚度=\"\"),0,激材有无*(基单价/基厚*材料厚度+基附加单价))",
    "9,62": "雕工长度数量*雕工长度单价",
    "9,25": "IFERROR(雕材有无*宽*高*个数/(基长/1000)/(基宽/1000)/亚克力板使用率*雕材校正,0)",
    "24,43": "IFERROR(ODATA(\"板材属性表?$select=长&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "14,53": "IFERROR(激工费/激工成品数量,0)",
    "24,47": "IFERROR(ODATA(\"板材属性表?$select=厚&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "24,54": "IFERROR(ODATA(\"板材属性表?$select=附加单价&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "14,1": "(雕材费-雕材废料金额)+(激材费-激材废料金额)",
    "24,24": "IFERROR(ODATA(\"板材属性表?$select=板材名称&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),\"\")",
    "14,35": "激主材费+激耗材费",
    "9,44": "废料单价*雕材废料重量",
    "9,31": "雕材数量*雕材单价",
    "14,38": "激材有无*(宽*100)*(高*100)*(材料厚度/10)*个数*密度*装灯面积率*(1+激材校正)/1000*激材校正",
    "9,50": "雕工有无*宽*高*个数*雕工校正",
    "14,14": "雕材废料金额+激材废料金额",
    "14,31": "激材数量*激材单价",
    "9,56": "雕工有无*(宽+高)/2*围边倍率*个数*雕工校正",
    "14,56": "IF((材料名称id=\"\")+(材料厚度=\"\"),0,激工有无*(宽+高)/2*围边倍率*个数*激工校正)",
    "24,35": "ODATA(\"形状属性表(\"&IF(ISBLANK(形状id),\"null\",形状id)&\")/亚克力板利用率/$value\")",
    "9,38": "雕材有无*(宽*100)*(高*100)*(材料厚度/10)*个数*装灯面积率/1000*雕材校正",
    "14,50": "IF((材料名称id=\"\")+(材料厚度=\"\"),0,激工有无*宽*高*个数*激工校正)",
    "24,31": "ODATA(\"形状属性表?$select=形状名称&$filter=ID eq \"&IF(ISBLANK(H10),\"null\",H10))",
    "14,41": "激材有无*(宽*100)*(高*100)*(材料厚度/10)*个数*密度*(1-装灯面积率)*(1+激材校正)/1000*激材校正",
    "14,4": "雕工费+激工费",
    "24,51": "IFERROR(ODATA(\"板材属性表?$select=基础单价&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "9,35": "雕主材费+雕耗材费",
    "9,33": "雕主材费*耗材占比",
    "9,1": "ODATA(\"组件名称属性表?$select=组件名称&$filter=ID eq \"&IF(ISBLANK(组件名称id),\"null\",组件名称id))",
    "24,38": "ODATA(\"形状属性表(\"&IF(ISBLANK(形状id),\"null\",形状id)&\")/装灯面积率/$value\")",
    "14,44": "废料单价*激材废料重量",
    "14,11": "雕材废料重量+激材废料重量",
    "9,28": "IF((材料名称id=\"\")+(材料厚度=\"\"),0,雕材有无*(基单价/基厚*材料厚度+基附加单价))",
    "24,60": "IFERROR(ODATA(\"板材属性表?$select=难度系数&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "24,49": "IFERROR(ODATA(\"板材属性表?$select=密度&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)",
    "14,59": "IF((材料名称id=\"\")+(材料厚度=\"\"),0,激工有无*ODATA(\"亚克力激光工费表?$select=单价&$filter=启用日期 le \"&IF(ISBLANK(创建时间),\"null\",TEXT(创建时间,\"yyyy-MM-ddThh:mm:ssZ\"))&\" and (截止日期 ge \"&IF(ISBLANK(创建时间-1),\"null\",TEXT(创建时间-1,\"yyyy-MM-ddThh:mm:ssZ\"))&\" or 截止日期 eq null)\")*难度系数)",
    "14,25": "IFERROR(激材有无*宽*高*个数/(基长/1000)/(基宽/1000)/亚克力板使用率*激材校正,0)",
    "14,33": "激主材费*耗材占比",
    "9,41": "雕材有无*(宽*100)*(高*100)*(材料厚度/10)*密度*个数*(1-装灯面积率)/1000*+雕材校正",
    "24,41": "ODATA(\"形状属性表(\"&IF(ISBLANK(形状id),\"null\",形状id)&\")/围边倍率/$value\")",
    "9,59": "雕工有无*ODATA(\"雕刻工费表?$select=单价&$filter=启用日期 le \"&IF(ISBLANK(创建时间),\"null\",TEXT(创建时间,\"yyyy-MM-ddThh:mm:ssZ\"))&\" and (截止日期 ge \"&IF(ISBLANK(创建时间-1),\"null\",TEXT(创建时间-1,\"yyyy-MM-ddThh:mm:ssZ\"))&\" or 截止日期 eq null)\")",
    "14,7": "雕材成品重量+激材成品重量",
    "14,62": "激工长度数量*激工长度单价",
    "24,18": "ODATA(\"组件名称属性表?$select=默认材料类型id&$filter=ID eq \"&IF(ISBLANK(组件名称id),\"null\",组件名称id))",
    "24,57": "IFERROR(ODATA(\"板材属性表?$select=耗材占比&$filter=ID eq \"&IF(ISBLANK(材料名称id),\"null\",材料名称id)),0)"
  },
  "CustomNames": [
    {
      "Name": "按钮",
      "Formula": "灯箱字面板2023_10_31!$L$27"
    },
    {
      "Name": "材料厚度",
      "Formula": "灯箱字面板2023_10_31!$V$10"
    },
    {
      "Name": "材料名称id",
      "Formula": "灯箱字面板2023_10_31!$Q$10"
    },
    {
      "Name": "规格表id",
      "Formula": "灯箱字面板2023_10_31!$B$25"
    },
    {
      "Name": "雕材成品重量",
      "Formula": "灯箱字面板2023_10_31!$AM$10"
    },
    {
      "Name": "雕材单价",
      "Formula": "灯箱字面板2023_10_31!$AC$10"
    },
    {
      "Name": "雕材废料金额",
      "Formula": "灯箱字面板2023_10_31!$AS$10"
    },
    {
      "Name": "雕材废料重量",
      "Formula": "灯箱字面板2023_10_31!$AP$10"
    },
    {
      "Name": "雕材费",
      "Formula": "灯箱字面板2023_10_31!$AJ$10"
    },
    {
      "Name": "雕材数量",
      "Formula": "灯箱字面板2023_10_31!$Z$10"
    },
    {
      "Name": "雕材校正",
      "Formula": "灯箱字面板2023_10_31!$AV$8"
    },
    {
      "Name": "雕材有无",
      "Formula": "灯箱字面板2023_10_31!$Y$10"
    },
    {
      "Name": "雕工成品单价",
      "Formula": "灯箱字面板2023_10_31!$BB$10"
    },
    {
      "Name": "雕工成品数量",
      "Formula": "灯箱字面板2023_10_31!$AY$10"
    },
    {
      "Name": "雕工费",
      "Formula": "灯箱字面板2023_10_31!$BK$10"
    },
    {
      "Name": "雕工校正",
      "Formula": "灯箱字面板2023_10_31!$BN$8"
    },
    {
      "Name": "雕工有无",
      "Formula": "灯箱字面板2023_10_31!$AX$10"
    },
    {
      "Name": "雕工长度单价",
      "Formula": "灯箱字面板2023_10_31!$BH$10"
    },
    {
      "Name": "雕工长度数量",
      "Formula": "灯箱字面板2023_10_31!$BE$10"
    },
    {
      "Name": "雕耗材费",
      "Formula": "灯箱字面板2023_10_31!$AH$10"
    },
    {
      "Name": "雕主材费",
      "Formula": "灯箱字面板2023_10_31!$AF$10"
    },
    {
      "Name": "废料单价",
      "Formula": "灯箱字面板2023_10_31!$BL$25"
    },
    {
      "Name": "高",
      "Formula": "灯箱字面板2023_10_31!$M$10"
    },
    {
      "Name": "个数",
      "Formula": "灯箱字面板2023_10_31!$O$10"
    },
    {
      "Name": "组件名称id",
      "Formula": "灯箱字面板2023_10_31!$H$25"
    },
    {
      "Name": "耗材占比",
      "Formula": "灯箱字面板2023_10_31!$BF$25"
    },
    {
      "Name": "基单价",
      "Formula": "灯箱字面板2023_10_31!$AZ$25"
    },
    {
      "Name": "基附加单价",
      "Formula": "灯箱字面板2023_10_31!$BC$25"
    },
    {
      "Name": "基厚",
      "Formula": "灯箱字面板2023_10_31!$AV$25"
    },
    {
      "Name": "基宽",
      "Formula": "灯箱字面板2023_10_31!$AT$25"
    },
    {
      "Name": "基长",
      "Formula": "灯箱字面板2023_10_31!$AR$25"
    },
    {
      "Name": "激材成品重量",
      "Formula": "灯箱字面板2023_10_31!$AM$15"
    },
    {
      "Name": "激材单价",
      "Formula": "灯箱字面板2023_10_31!$AC$15"
    },
    {
      "Name": "激材废料金额",
      "Formula": "灯箱字面板2023_10_31!$AS$15"
    },
    {
      "Name": "激材废料重量",
      "Formula": "灯箱字面板2023_10_31!$AP$15"
    },
    {
      "Name": "激材费",
      "Formula": "灯箱字面板2023_10_31!$AJ$15"
    },
    {
      "Name": "激材数量",
      "Formula": "灯箱字面板2023_10_31!$Z$15"
    },
    {
      "Name": "激材校正",
      "Formula": "灯箱字面板2023_10_31!$AV$13"
    },
    {
      "Name": "激材有无",
      "Formula": "灯箱字面板2023_10_31!$Y$15"
    },
    {
      "Name": "激工成品单价",
      "Formula": "灯箱字面板2023_10_31!$BB$15"
    },
    {
      "Name": "激工成品数量",
      "Formula": "灯箱字面板2023_10_31!$AY$15"
    },
    {
      "Name": "激工费",
      "Formula": "灯箱字面板2023_10_31!$BK$15"
    },
    {
      "Name": "激工校正",
      "Formula": "灯箱字面板2023_10_31!$BN$13"
    },
    {
      "Name": "激工有无",
      "Formula": "灯箱字面板2023_10_31!$AX$15"
    },
    {
      "Name": "激工长度单价",
      "Formula": "灯箱字面板2023_10_31!$BH$15"
    },
    {
      "Name": "激工长度数量",
      "Formula": "灯箱字面板2023_10_31!$BE$15"
    },
    {
      "Name": "激耗材费",
      "Formula": "灯箱字面板2023_10_31!$AH$15"
    },
    {
      "Name": "激主材费",
      "Formula": "灯箱字面板2023_10_31!$AF$15"
    },
    {
      "Name": "宽",
      "Formula": "灯箱字面板2023_10_31!$K$10"
    },
    {
      "Name": "密度",
      "Formula": "灯箱字面板2023_10_31!$AX$25"
    },
    {
      "Name": "难度系数",
      "Formula": "灯箱字面板2023_10_31!$BI$25"
    },
    {
      "Name": "围边倍率",
      "Formula": "灯箱字面板2023_10_31!$AP$25"
    },
    {
      "Name": "形状名称",
      "Formula": "灯箱字面板2023_10_31!$AF$25"
    },
    {
      "Name": "形状id",
      "Formula": "灯箱字面板2023_10_31!$H$10"
    },
    {
      "Name": "亚克力板使用率",
      "Formula": "灯箱字面板2023_10_31!$AJ$25"
    },
    {
      "Name": "装灯面积率",
      "Formula": "灯箱字面板2023_10_31!$AM$25"
    },
    {
      "Name": "id",
      "Formula": "灯箱字面板2023_10_31!$E$25"
    },
    {
      "Name": "创建时间",
      "Formula": "灯箱字面板2023_10_31!$R$15"
    },
    {
      "Name": "页面名称",
      "Formula": "灯箱字面板2023_10_31!$L$25"
    },
    {
      "Name": "自动更新",
      "Formula": "灯箱字面板2023_10_31!$BT$27"
    },
    {
      "Name": "组件名称",
      "Formula": "灯箱字面板2023_10_31!$B$10"
    },
    {
      "Name": "材料类型id",
      "Formula": "灯箱字面板2023_10_31!$S$25"
    }
  ]
}